/*
$Author$
$Date$
$Tag$
$IdShort$
$Id$
$IdInfo$
*/
#ifndef __NET_H
	#define __NET_H

//								ФЛАГИ МЕРЕЖЕВИХ ПРИСТРОЇВ

//------------------------------------------------------------------------------------------------
//																						net_stat
//------------------------------------------------------------------------------------------------
/*
	#define NETDEV_OP 				0x0001	//сетевое устройство запущено
	#define NETDEV_CL 				0x0002	//сетевое устройство закрыто/остановлено
	#define NETDEV_ST_OP			0x0004	//сетевое устройство закрыто
	#define NETDEV_OPER 			0x0008	//устройство в опере (не на концерте)
	#define NETDEV_PRESS_ERROR 		0x0010	//авария по перепаду давления
	#define NETDEV_MP_ERROR			0x0020	//авария по магнитному пускателю
	#define NETDEV_OS_ERROR			0x0040	//авария по обратной связи
//	#define NETDEV_NETOK			0x0080	//устройство доступно по сети
*/
//------------------------------------------------------------------------------------------------
//																				net_stat for kogs
//------------------------------------------------------------------------------------------------
	#define DEV_OPEN 	 			0x0001	//упарвління пристроем
	#define DEV_CLOSE				0x0002
	#define DEV_OPER				0x0008
	#define DEV_DIST				0x0010
		//for dvigun
		#define DEV_D_P 			0x0080	//перепад тиску на пристрої
		#define DEV_OS	 			0x0004	//наявність зворотньго звязку
		//for klapan
		#define DEV_SUX1 			0x0080	//сухий контакт №1
		#define DEV_SUX2 			0x0040	//сухий контакт №2
//------------------------------------------------------------------------------------------------
//																						net_cmd
//------------------------------------------------------------------------------------------------
	#define PSK_NETDEV 				0x0001	//пуск сетевого устройства
	#define STP_NETDEV 				0x0002	//стоп/закрытие сетевого устройства
	#define CLS_NETDEV 				0x0004	//закрытие сетевого устройства
	#define RESET_NETDEV 			0x0008	//сетевое устройство закрыто/остановлено
	#define DEV_DIST				0x0010	//перевід мережевого в дистанційний режим
//------------------------------------------------------------------------------------------------
//																						enh_info
//------------------------------------------------------------------------------------------------
	#define DEV_ON_NET 	 			0x0020	//знаходження пристрою в мережі

//------------------------------------------------------------------------------------------------
#endif
