#ifndef __NLS_02_H
	#define __NLS_02_H



//	#define mZ_21		        LED_FIELD[78]
    #define mVZK_0_14	        LED_FIELD[12+80*17]
    #define mVZK_0_15	        LED_FIELD[ 0+80*0]
    #define mVZK_0_16	        LED_FIELD[13+80*17]
    #define mVZK_0_17	        LED_FIELD[14+80*17]
    #define mVZK_0_18	        LED_FIELD[15+80*17]

    #define mVZK_0_19	        LED_FIELD[ 0+80*0]
    #define mVZK_0_20	        LED_FIELD[48+80*17]
    #define mVZK_0_21	        LED_FIELD[49+80*17]
    #define mVZK_0_22	        LED_FIELD[50+80*17]
    #define mVZK_0_23	        LED_FIELD[51+80*17]

    #define mVZK_0_24	        LED_FIELD[52+80*17]
    #define mVZK_0_25	        LED_FIELD[53+80*17]
    #define mVZK_1_6	        LED_FIELD[28+80*17]
    #define mVZK_1_7	        LED_FIELD[29+80*17]
    #define mVZK_1_8	        LED_FIELD[31+80*17]

    #define mVZK_1_9	        LED_FIELD[64+80*17]
    #define mVZK2_2_8	        LED_FIELD[ 4+80*15]
    #define mVZK2_2_9	        LED_FIELD[ 5+80*15]
    #define mVZK2_2_10	        LED_FIELD[ 6+80*15]
    #define mVZK2_2_11	        LED_FIELD[ 7+80*15]

    #define mVZK3_3_6	        LED_FIELD[20+80*15]
    #define mVZK3_3_7	        LED_FIELD[21+80*15]

    #define mVZK3_3_7	        LED_FIELD[21+80*15]


//-------------------------------------------------------------------------
//														  мережеві пристрої
//-------------------------------------------------------------------------

//-------------------------------------------------------------------------
//															 сухие контакты
//-------------------------------------------------------------------------

//-------------------------------------------------------------------------
//															 обратные связи
//-------------------------------------------------------------------------

//--------------------------------------------------------------------------
//																	  выдача
//--------------------------------------------------------------------------



#endif
